Repository: 84000/data-translation-memory
Catalog: toh235-v3.tmx
Source language: bo
Languages: en

source: ཡེ་ཤེས་ཀྱི་ཏོག་གི་ཆུའི་རྒྱུན་གྱི་སྤྲིན་གྱི་དཀྱིལ་འཁོར་དཔལ་དང་ལྡན་པ་གསེར་གྱི་འོད་ཟེར་རྣམ་པར་སྣང་བར་བྱེད་པ། སྐྲའི་རྩེ་མོའི་ཆ་ཤས་གཅིག་ལས་བྱུང་བའི་རུས་དང་རིགས་ཀྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་མཚན་བཟུང་བར་བྱ། ཡིད་ལ་བྱའོ། །དེ་དག་གིས་ཀླུ་ཐམས་ཅད་དང་། ཀླུའི་རིགས་ཐམས་ཅད་དང་། ཀླུའི་རུས་ཐམས་ཅད་དང་། ཀླུའི་ཆོ་རིགས་ཐམས་ཅད་དང་།
en: Nāga lord, furthermore, you should uphold and bear in mind the names of the tathāgatas who manifest emanations with the brilliant essence of all the blessings arisen from the family of clouds, who possess a glorious multitude of water-holding clouds of banners of gnosis, and whose lineage and family arise from a single portion of the tip of a hair of golden Vairocana.

source: ཀླུའི་འབྱུང་བ་ཐམས་ཅད་དང་། ཀླུའི་སྐྱེ་གནས་ཐམས་ཅད་དང་། ཀླུའི་རྒྱལ་པོ་ཐམས་ཅད་དང་། ཀླུའི་བུ་མོ་ཐམས་ཅད་དང་། ཀླུའི་གཡོག་ཐམས་ཅད་ཀྱི་ཀླུའི་སྡུག་བསྔལ་ཐམས་ཅད་རྒྱུན་གཅོད་པར་བྱེད། བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་དོ།
en: These names will eliminate all the suffering of the nāgas and fulfill all the provisions of happiness for all nāgas, all nāga families, all nāga lineages, all nāga paternal lines, all nāga origins, all nāga birthplaces, all nāga kings, all nāga daughters, and all nāga servants.

source: །ཀླུའི་བདག་པོ་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་མཚན་དེ་དག་གང་ཞེ་ན།
en: What are these names?

source: འདི་ལྟ་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་སྙིང་པོ་ཅན་གྱི་སྤྲིན་ཆེན་པོ་ལ་ཕྱག་འཚལ་ལོ།
en: They are as follows: “Homage to the bhagavān tathāgata Vairocanagarbhamahāmegha.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཀླུའི་རིགས་ལས་བྱུང་བ་སྤྲིན་གྱིས་རྣམ་པར་མཛེས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Nāgakulodbhavameghavirājita.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་གྱི་ཆུ་འཛིན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Water-Holding Cloud.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དཔལ་ལྡན་སྤྲིན་གྱི་གཟི་བརྗིད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Splendor of Glorious Clouds.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་འབྱུང་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud Arising.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རླུང་གི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་འཇོམས་པའི་སྤྲིན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Cloud That Vanquishes All Arrays of Wind.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ནམ་མཁའ་དཔག་མེད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Unfathomable Space.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་པོའི་གློག་འབར་བའི་ཚོགས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud’s Host of Blazing Lightning.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་མཐུ་རྩལ་དཔའ་བོ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Powerful Great Cloud Hero.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་མཛེས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Beautiful Cloud.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་སྟུག་ཆེན་པོ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Thick Cloud.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Multitude of Clouds.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་གྱི་འོད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Cloud Light. “

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་སེང་གེ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud Lion.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་གདུགས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud Parasol.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བལྟ་སྡུག་སྤྲིན་ཆེན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Pleasant Appearance Great Cloud.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་པོས་ཁེབས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Filled with Great Clouds.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ལས་བྱུང་བ་སྣང་བར་བྱེད་པའི་དཀྱིལ་འཁོར་ཕྱོགས་བཅུ་མཐོ་འགེབས་རྔའི་སྒྲ་དབྱངས་ཤིན་ཏུ་རབ་སྒྲོགས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Resounding of the Drum Tones Pervading All Ten Directions of the Brilliant Maṇḍala Arisen from Clouds.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་བསིལ་འབྱུང་མི་དགའ་རབ་འཇོམས་སྒྲ་ཟབ་སྒྲོགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cooling Cloud’s Deep Roar That Vanquishes Unhappiness.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་བདལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Expansive Great Cloud.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཆུ་སྤྲིན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Ganges Water Cloud.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྩལ་གྱིས་སྤྲིན་ལྟར་དཔའ་བོ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Powerful Cloud-Like Hero.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འབྲུག་སྒྲ་བསྒྲགས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Dragon’s Roar Resounding.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཀུན་དུ་སྟོན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Display of All Clouds.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་རྒྱ་ཆེན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud Expanse. “

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་འཛག་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Dripping Cloud.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ལྟར་རྣམ་པར་སྒྲོགས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Cloud-Like Resounding.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ལྟར་འཕགས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Cloud-Like Exaltation.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ལྟ་བུའི་ན་བཟའ་མནབས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Wearing Cloud-Like Garments.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་གྱིས་ལོ་ཏོག་སྐྱེད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Cloud-Born Harvest.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་གྱི་གནས་ལ་གནས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Abiding in the Cloud Abode.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆར་སྤྲིན་གྱི་སྤྲིན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Rain Cloud.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་འདུ་བར་མཛད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Cloud Gatherer.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་རྣམ་པར་རྒྱས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Abundant Clouds.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་ཨུད་པ་ལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud Utpala.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་སྤོས་ཀྱི་སྐུ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud Incense Body.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་འཕགས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud Exaltation.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་དབང་ཕྱུག་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud Lord.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་འོད་མཛད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud Illuminator.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་བྱིན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud Bestowal.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་སྤྲིན་ལྟ་བུ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Like a Cloud of Great Precious Jewels.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ལྟར་རྣམ་པར་འཇོམས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Cloud-Like Victory. “

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་གྱི་ཆུ་བོ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Cloud River.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་སྡུད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Collected Clouds.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དུས་མ་ཡིན་པའི་སྤྲིན་དང་ལྕེ་འབབ་པ་རྣམ་པར་འཇོམས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Vanquishing Untimely Clouds and Lightning.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་པོ་ལྟར་ནམ་མཁའ་མཐོང་ནས་བསྒྲགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud-Like Vision Appearing and Resounding in Space.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་སྒྲ་འབྱིན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud Emitting Sound.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་ཆར་ཆུ་སྐྱེས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud Producing Rainfall.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྙོམས་པའི་གཟི་བརྗིད་སྒྲུབ་པའི་སྤྲིན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Cloud Fulfilling Equanimity’s Splendor.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རོ་བྲོ་བ་དྲུག་དང་ལྡན་པའི་ཆུ་ཆེན་པོའི་སྤྲིན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Cloud’s Great Water Endowed with Six Flavors.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆུ་འཐོར་སྤྲིན་ཆེན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Cloud Spray.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་རྒྱ་མཚོ་འགེངས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Great Clouds Filling the Ocean.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆར་མི་འབབ་པ་ན་སྤྲིན་གྱིས་ཀུན་དུ་འགེབས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Complete Cloud Coverage in Times of Drought.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་གཟུགས་མཐའ་ཡས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bhagavān tathāgata Infinite Cloud Forms.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤྲིན་ཆེན་པོ་ཐམས་ཅད་རྣམ་པར་སྒྲུབ་པ། འཛམ་བུའི་སྤྲིན་གྱི་དཔལ་གྱི་གཟི་བརྗིད་འོད་མཛད་པ་སྤྲིན་གྱི་འོད་ཟེར་ཅན་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the bhagavān, tathāgata, foe-destroyer, complete and perfect buddhas of the great cloud, who possess the brilliance of the cloud that illuminates all the clouds in the continent of Jambudvīpa with glorious, splendid radiance. “

source: །ཀླུའི་བདག་པོ་དེ་བཞིན་གཤེགས་པའི་མཚན་འདི་དག་བརྗོད་པས་ཀླུ་ཐམས་ཅད་ཀྱི་ཀླུའི་སྡུག་བསྔལ་ཐམས་ཅད་རྒྱུན་འཆད་པ་དང་། བདེ་བ་ཐམས་ཅད་དང་ལྡན་པ་དང་། འཛམ་བུའི་གླིང་འདིར་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་འབབ་པ་དང་། རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་།
en: Nāga lord, by proclaiming the names of these tathāgatas, you can eliminate all the suffering specific to nāgas of all the nāgas, bestow happiness, send abundant rains again and again here to continent of Jambudvīpa, and cause all grasses, trees, medicinal herbs, forests, and crops to grow.”

source: ནགས་ཚལ་དང་། ལོ་ཐོག་ཐམས་ཅད་སྐྱེད་པར་བྱེད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་ཀླུའི་བདག་པོ་གཡོག་མཐའ་ཡས་རྒྱ་མཚོའི་སྤྲིན་བཀོད་པའི་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་གདུགས་ལྟ་བུའི་རྒྱལ་པོས་གསོལ་བ་བཏབ་པ། བཅོམ་ལྡན་འདས་སླད་མའི་ཚེ་སླད་མའི་དུས་ན་འཛམ་བུའི་གླིང་འདིར་ཆར་མི་འབབ་པའི་ཚེ་གང་དག་བརྗོད་ན་ཆར་གྱི་རྒྱུན་ཆེན་པོ་འབབ་པར་བགྱིད་པ་དང་། མི་བཟད་པའི་དུས་ཀྱི་ཚེ་དང་། གནོད་པ་འབྱུང་བའི་དུས་ཀྱི་ཚེ་དང་། ཆོས་མ་ལགས་པས་སྐྱེ་བོ་འཐབ་པའི་དུས་ཀྱི་ཚེ་དང་། ཡམས་ཀྱི་ནད་དང་། གནོད་པ་འབྱུང་བའི་དུས་ཀྱི་ཚེ་དང་།
en: Then Ananta­parikara­sāgara­megha­vyūha­tejo­maṇḍala­chartākāra­rāja, lord of the all the nāgas in the trichiliocosm, addressed the Bhagavān, asking, “Bhagavān, in future times and future seasons when rain is not falling here in the continent of Jambudvīpa, what words can be spoken so that a great rain can be made to fall?

source: ནད་དང་འཆི་བའི་དུས་ཀྱི་ཚེ་དང་། སྐར་མ་མ་རུངས་པ་གནས་པའི་དུས་ཀྱི་ཚེ། ཡམས་ཀྱི་ནད་དང་། འཚེ་བ་དང་། གནོད་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པ་དེ་ལྟ་བུའི་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་རྣམས་བཤད་དུ་གསོལ།
en: I beg you to pronounce the words of such a secret-mantra dhāraṇī that can utterly pacify all plague, hostility, and harm when one is terrified, when harm arises, when one is drawn into conflict with lawless people, when plague and harm arise, when one is sick or dying, and when the constellations are in inauspicious abodes.

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་གསོལ། གང་དག་ཀླུ་ཐམས་ཅད་ལ་ཡང་དག་པར་བསྐུལ་མ་འདེབས་པར་འགྱུར་བ་དང་། ལྷ་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་འགྱུར་བ་དང་། བདུད་ཐམས་ཅད་རྣམ་པར་འཇོམས་པར་འགྱུར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཇིགས་པ་ཐམས་ཅད་འཇིག་པར་འགྱུར་བ་དང་། གནོད་པ་ཐམས་ཅད་ཟློག་པར་འགྱུར་བ་དང་།
en: I beg you to bless us with the blessings of the Buddha. “

source: ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བ་བགྱིད་པ་དང་། རྒྱུ་སྐར་མ་རུངས་པས་བགྱིས་པ་རབ་ཏུ་ཞི་བར་འགྱུར་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཆར་པའི་བར་ཆད་ལྔ་གསུངས་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་སེལ་བར་འགྱུར་བ་དང་། འཛམ་བུའི་གླིང་འདིར་ཆར་པའི་རྒྱུན་ལེགས་པར་འབབ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་རྣམས་བཅོམ་ལྡན་འདས་མཆོག་ཏུ་ཐུགས་རྗེ་དང་ལྡན་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་ཐུགས་བརྩེ་བ་དང་ལྡན་པས་བཤད་དུ་གསོལ།
en: I beg the Bhagavān, with your supreme compassion and concern for the welfare of all sentient beings, to pronounce the words of such a secret-mantra dhāraṇī that can exhort all the nāgas, bring joy to all the gods, vanquish all māras, destroy all sentient beings’ fears, turn back all harm, produce peace and auspiciousness, pacify the effects of all inauspicious constellations, clear away all five obstacles to rainfall spoken by the Bhagavān, and cause excellent rain to fall here in the continent of Jambudvīpa.

source: བཅོམ་ལྡན་འདས་བདག་དེ་བཞིན་གཤེགས་པ་ལ་གསོལ་པ་འཚལ་ལོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Bhagavān, this I beg of you.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་གཡོག་མཐའ་ཡས་རྒྱ་མཚོའི་སྤྲིན་བཀོད་པའི་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་གདུགས་ལྟ་བུའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀླུའི་བདག་པོ་ཁྱོད་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དང་། ཕན་པ་དང་། བདེ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་གསོལ་བ་འདེབས་པ་ལེགས་སོ་ལེགས་སོ།
en: The Bhagavān replied to Ananta­parikara­sāgara­megha­vyūha­tejo­maṇḍala­chartākāra­rāja, “Nāga lord, it is excellent, excellent, that you have asked this question of the Tathāgata for the sake of all sentient beings’ welfare, benefit, and happiness.

source: །ཀླུའི་བདག་པོ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: Nāga lord, in that case, you should listen well and bear my words in mind.

source: སྙིང་རྗེ་ཆེན་པོ་ལས་བྱུང་བ་འབྲུག་ཆེན་པོའི་སྒྲ་ཅན་བསྒྱིངས་པ་དཔའ་བའི་ཏོག་ཅེས་བྱ་བའི་གཟུངས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དང་།
en: There is a dhāraṇī called the crest of heroic majesty endowed with the great roar of thunder that arises from great compassion.

source: ཕན་པ་དང་། བདེ་བའི་ཕྱིར་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པ། བྱིན་གྱིས་བརླབས་པ། རྗེས་སུ་ཡི་རང་བ་བཤད་པར་བྱ་སྟེ།
en: For the sake of all sentient beings’ welfare, benefit, and happiness, all the buddhas spoke this dhāraṇī, blessed it, rejoiced in it, and explained it.

source: དེ་ནི་ཆར་མེད་པའི་ཚེ་ཆར་འབབ་པར་བྱེད།
en: When there is no rain, it can cause a great rainfall.

source: ཆར་ཆེས་ན་གཅོད་འཆི་བའི་གནོད་པ་རབ་ཏུ་ཞི་བར་བྱེད། ཀླུ་ཐམས་ཅད་སྐུལ་བར་བྱེད། ལྷ་ཐམས་ཅད་སིམ་པར་བྱེད། བདུད་ཐམས་ཅད་རྣམ་པར་འཇོམས་པར་བྱེད། སེམས་ཅན་ཐམས་ཅད་བདེ་བ་ཐམས་ཅད་དང་ལྡན་པར་བྱེད་དོ། །ཏདྱ་ཐཱ། མ་ཧཱ་ཛྙཱ་ན་ཨ་བ་བྷཱ་སཱ་ནི། ཤྲཱི་ཏེ་ཛོ་ལཀྵྨི་བྲྀཥྚི་པིཀྲ་མ། བཛྲ་སིང་ཧ་ཏ་ནེ། པ་ར་མ་བི་རཱ་ཛ། ནིརྨ་ལ་གུ་ཎ་ཀེ་ཏུ་སཱུརྱ་པྲ་བྷེ། བི་མ་ལཱང་ག་ཡཥྚི། བྷ་ར་བྷ་ར། སམ་བྷ་ར་སམ་བྷ་ར། དུ་དུམ་བུ། ཧ་ན་ཧ་ན། མ་ཧ་པྲ་བྷེ། བི་བྷཱུ་ཏ་མ་ཧཱ་མ་ཧོ་ཨན་དྷ་ཀཱ་རེ། པྲཛྙཱ་གྲ་ཤུད་དྷེ། པ་རི་པཱུ་རྞྞ་མཻ་ཏྲེ། མཻ་ཏྲ་བི་ར་ཎ་སྐན་དྷ། མཻ་ཏྲཱ་མ་བུདྡྷ་རེ། ཛ་ལ་ཛ་ལ། ཛ་ལ་ཛ་ལ། ཛ་ལམ་བུདྡྷ་རེ། བོ་དྷྱད་ག་ཀུ་སུ་མེ། ད་ཤ་བ་ལེ། ཙ་ཏུར་བེ་ཤྭ་ར་དྷེ། ཨ་ཤྚཱ་ད་ཤ། ཨ་པ་ནི་ག་བུད་དྷ་དྷ་རྨེ། ཤུ་བྷ་མ་དི། པུ་ཎྱ་རཱ་ཤི། ཤུ་ཀླ་དྷར་མ་ས་མ་ནྭི་ཏེ། གམ་བྷཱི་རེ། བི་ར་ཛ་སེ། བི་མ་ལེ་བི་ཤི་ཥ་པྲཱ་པྟེ། ནི་རཱ་སྲ་པ་དྷརྨེ། སརྦ་ལོ་ཀཛྱཻཥྛ། ཛེཥྛ་པར་པྲ་བ་རེ། ཨ་ནུཏྟ་རེ། ཨ་སང་གེ །དྷ་ར་དྷ་ར། དྷི་རི་དྷི་རི། དྷུ་རུ་དྷུ་ར་ཤཱནྟ་མ་ཏེ། ཤཱན་ཏ་བེ་གེ །ཙ་ར་ཙ་ར། ཙ་ར་ཙ་ར།
en: When there is great rain, it can cause it to stop.

source: ཙི་རི་ཙི་རི། ཙུ་རུ་ཙུ་རུ། པ་ར་མ་བུད་དྷཱ་ནུ་མ་ཏེ། མ་ཧ་པྲ་ཛྙཱ་པཱ་ར་མི་ཏེ་སྭཱ་ཧཱ། དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཡེ་ཤེས་རྒྱ་མཚོ་དང་ལྡན་པ་ལ་ཕྱག་འཚལ་ལོ།
en: It can completely pacify all fatal harm, exhort all the nāgas, please all the gods, vanquish all māras, and bring all manner of happiness to all sentient beings: tadyathā || mahājñāna avabhāsāni śrītejolakṣmi vṛṣṭivikrama vajra siṁhatane paramavirāja nirmalaguṇa ketusūryaprabhe vimalāṇgayaṣṭi bhara bhara sambhara sambhara dudumbu hana hana mahāprabhe vibhūta mahā maho andhakāre prajñāgraśuddhe paripūrṇṇamaitri maitri viraṇaskandha maitrāmabuddhare jala jala jala jala jalam buddhare bodhyaṅgakusume daśabale caturveśvaradhe aṣṭādaśa apanigabuddhadharme śubhamadi puṇyarāśi śukladharmasamanvite gambhāre virajase vimale viśiṣaprāpte nirāsrapadharme sarvalokajyaiṣṭha jeṣṭhaparapravare anuttare asaṇge dhara dhara dhiri dhiri dhuru dhura śāntamahe śāntavege cara cara cara cara ciri ciri curu curu paramabuddhānumate mahāprajñāpāramite svāhā || Homage to the tathāgata Vairocana, endowed with oceans of gnosis.

source: །སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །དེ་ནས་འཛམ་བུའི་གླིང་འདིར་ཆར་དབབ་པའི་ཕྱིར་ཀླུ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་བརྗོད་པར་བྱའོ།
en: To make a great rain fall here on the continent of Jambudvīpa, I will proclaim the essential mantra of all the nāgas.

source: །སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་བདེན་པས་ཆར་པའི་བར་ཆད་བྱེད་པ་ལྔ་བསལ་བར་བྱའོ། །སདྱཱ་ཐེ་དན། ས་ར་ས་ར།
en: By the verity of all the buddhas and bodhisattvas, all five obstacles to rainfall will be cleared away.

source: སི་རི་སི་རི། སུ་རུ་སུ་རུ་ནཱ་གཱ་ནཱན། ཛ་བ་ཛ་བ། ཛི་བི་ཛི་བི།
en: syād yathedam || sara sara siri siri suru suru nāgā nāgā java java jivi jivi juvu juvu || Great nāgas, come quickly!

source: ཛུ་བུ་ཛུ་བུ། ཀླུ་ཆེན་པོ་དག་ཚུར་ཤེག །སངས་རྒྱས་ཀྱི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག །ཙ་ར་ཙ་ར། ཙི་རི་ཙི་རི།
en: By the verity of the Buddha, send down a great rainfall here in the continent of Jambudvīpa!

source: ཙུ་རུ་ཙུ་རུ། ཀླུའི་བདག་པོ་ཆེན་པོ་དག་ཚུར་ཤེག །ཀྱེ་ཀླུ་ཆེན་པོ་དག །
en: cara cara ciri ciri curu curu Great nāgas, come quickly!

source: སངས་རྒྱས་ཀྱི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག །བ་ར་བ་ར། བི་རི་བི་རི། བུ་རུ་བུ་རུ།
en: By the verity of the Buddha, send down a great rainfall here in the continent of Jambudvīpa!

source: སངས་རྒྱས་ཀྱི་བདེན་པས་ཀླུ་ཐམས་ཅད་དགུག་པར་བྱའོ། །བྱམས་པའི་སེམས་དང་། སྙིང་རྗེའི་སེམས་དང་། དགའ་བའི་སེམས་དང་།
en: vara vara viri viri vuru vuru By the verity of the Buddha, all nāgas are summoned.

source: བཏང་སྙོམས་ཀྱི་སེམས་དང་། སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་དང་། བདེན་པ་དང་། བྱམས་པ་ཆེན་པོས་ཀླུའི་བདག་པོ་ཆེན་པོ་དག་ཚུར་ཤེག །
en: With minds of loving-kindness, compassion, sympathetic joy, and equanimity, through the great blessings, verity, and kindness of all the buddhas and bodhisattvas, great nāgas, come quickly!

source: སངས་རྒྱས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་རྣམས་དྲན་པར་གྱིས་ཤིག །བྷ་ར་བྷ་ར། བྷི་རི་བྷི་རི།
en: Remember the Buddha’s Dharma and the qualities of the bodhisattvas!

source: བྷུ་རུ་བྷུ་རུ། ཆུ་ཆེན་པོའི་ཆུ་དང་། སྤྲིན་གྱི་ཆུ་འཆང་བ་ཅན་ལག་གིས་འགྲོ་ཆེན་པོའི་གཡོག་རྣམས་བྱམས་པའི་སེམས་ཀྱིས་ཚུར་ཤེག །
en: bhara bhara bhiri bhiri bhuru bhuru With minds of loving-kindness, all you great wriggling attendants who hold the water of the great rivers and clouds, come quickly!

source: སྟོན་པའི་བསྟན་པ་དམ་པ་དྲན་པར་གྱིས་ཤིག །གྷ་ཌ་གྷ་ཌ། གྷི་ཌི་གྷི་ཌི།
en: Remember the teacher’s sublime teachings!

source: གྷུ་ཌུ་གྷུ་ཌུ། དྲག་ཤུལ་ཅན་ཁྲོ་བ་ཤུགས་ཆེན་པོ་དང་ལྡན་པ། དུག་ཆེན་པོའི་ལྕེ་འབྱིན་པ་རྣམས་བྱམས་པའི་སེམས་དང་ལྡན་པར་ཚུར་ཤེག །
en: ghaḍa ghaḍa ghiḍi ghiḍi ghuḍu ghuḍu With minds of loving-kindness, all you fierce, wrathful, powerful poison-tongued ones, come quickly!

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་ཕོབ་ཤིག །སྭཱ་ཧཱ། ཏ་ཊ་ཏ་ཊ།
en: By the verity of all the tathāgatas, send down rainfall here in the continent of Jambudvīpa, svāhā!

source: ཏི་ཊི་ཏི་ཊི། ཏུ་ཊུ་ཏུ་ཊུ། ནོར་བུ་ཆེན་པོའི་ཅོད་པན་ཐོགས་པ་དང་ལྡན་པ་སྦྲུལ་གདུག་པའི་གཟུགས་ཅན་རྣམས་དཀོན་མཆོག་གསུམ་གྱི་བྱིན་གྱི་རླབས་དྲན་པར་གྱིས་ལ།
en: taṭa taṭa tiṭi tiṭi tuṭu tuṭu All you with your emanated poisonous bodies bearing great jeweled crowns, remember the blessings of the Three Jewels!

source: རྡོ་རྗེ་འཆང་གི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་ཕོབ་ཤིག །སྭཱ་ཧཱ། ཀ་ལ་ཀ་ལ། ཀི་ལི་ཀི་ལི། ཀུ་ལུ་ཀུ་ལུ།
en: By the verity of Vajrapāṇi, send down rainfall here in the continent of Jambudvīpa, svāhā!

source: ཆུ་ཆེན་པོ་ལ་གནས་པ་དང་ལྡན་པ་སྤྲིན་ཆེན་པོ་བརྩེགས་པའི་བཞོན་པ་ལ་ཞོན་ནས་མངོན་པར་འགྲོ་བ་རྣམས་ཚུར་ཤེག །
en: kala kala kili kili kulu kulu All you who dwell in the great waters and ride mounted on chariots of stacked clouds, come quickly!

source: བྱམས་པའི་སེམས་ཀྱིས་འཛམ་བུའི་གླིང་འདིར་ཆར་གྱི་རྒྱུན་ཐོང་ཤིག །
en: With minds of loving-kindness, send down a flow of rainfall here in the continent of Jambudvīpa!

source: དེ་བཞིན་གཤེགས་པའི་བདེན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་ལག་ན་རྡོ་རྗེས་བསྒོ་བ། ར་ལ་ར་ལ། རི་ལི་རི་ལི།
en: You are commanded by Vajrapāṇi, by the verity and blessings of the Tathāgata!

source: རུ་ལུ་རུ་ལུ། ལག་གིས་འགྲོ་བ་ཐམས་ཅད་ཁྱེད་རྣམས་གཉིད་མེད་པར་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པའི་བདེན་པས། གྷ་མ་གྷ་མ། གྷི་མི་གྷི་མི། གྷུ་མུ་གྷུ་མུ་སྭཱ་ཧཱ། ཀླུ་ཐམས་ཅད་དགུག་གོ།
en: rala rala rili rili rulu rulu All you slitherers, abandon your sleep, and through the power of the tathāgatas of the three times: ghama ghama ghimi ghimi ghumu ghumu svāhā All nāgas, you are summoned!

source: །བྱམས་པའི་སེམས་ཀྱིས་བྱང་ཆུབ་ཀྱི་སེམས་སྔོན་དུ་འགྲོ་བས། ན་ར་ན་ར། ནི་རི་ནི་རི། ནུ་རུ་ནུ་རུ། སྭཱ་ཧཱ། ཡོན་པོ་སྣ་ཚོགས་སུ་གྱུར་མགོ་སྟོང་པ། མགོ་དང་མིག་དམར་བ། སྟོབས་ཆེ་བའི་ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་དགུག་པར་བྱའོ།
en: With minds of loving-kindness, generating the preliminary mind of awakening: nara nara niri niri nuru nuru svāhā All you great powerful mahoragas with a thousand different crooked heads, red heads, and red eyes, you are summoned!

source: །ཀྱེ་ཀྱེ་ལག་གིས་འགྲོ་ཆེན་པོ་དག་མཆོག་ཏུ་ཐུགས་རྗེ་ཅན། བསོད་ནམས་ཐམས་ཅད་ཀྱི་གཟི་བརྗིད་ཀྱིས་བརྗིད་པ་ཉོན་མོངས་པ་དང་བྲལ་བ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བྱིན་གྱི་རླབས་དྲན་པར་གྱིས་ཤིག །ག་ཊ་ག་ཊ། གི་ཊི་གི་ཊི།
en: Hey, hey, you great slitherers, remember the tathāgatas, who possess supreme compassion, blaze with the splendor of all merit, and are free from the afflictions!

source: གུ་ཊུ་གུ་ཊུ། སྭཱ་ཧཱ། སྟོབས་དང་། ཕ་རོལ་གནོན་པ་དང་། གཟི་བརྗིད་ཐོགས་པ་མེད་པ་དང་ལྡན་པ་དག་གིས་འཛམ་བུའི་གླིང་འདིར་ཆར་གྱི་རྒྱུན་རྣམས་ཕོབ་ཤིག །ཤ་ར་ཤ་ར།
en: gaṭa gaṭa giṭi giṭi guṭu guṭu svāhā All you powerful vanquishers, endowed with unobstructed brilliance, send down rainfall here in the continent of Jambudvīpa!

source: ཤི་རི་ཤི་རི། ཤུ་རུ་ཤུ་རུ། སྭཱ་ཧཱ། ཀྱེ་ཀྱེ་ཀླུ་ཆེན་པོ་རྣམས་རང་རང་གི་རིགས་དང་། ཆོ་རིགས་དྲན་པར་གྱིས་ལ་མ་ཤོལ་བར་ལྷ་ཐམས་ཅད་ཀྱི་བདེན་པའི་བྱིན་གྱི་རླབས་ཀྱིས་འཛམ་བུའི་གླིང་འདིར་ཆར་གྱི་རྒྱུན་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: śara śara śiri śiri śuru śuru svāhā Hey, hey, great nāgas, remember your own families and your paternal lineages, and without delay, through the blessings of the verity of all gods, send down flowing rainfall here in the continent of Jambudvīpa, svāhā.

source: ཚངས་པའི་བདེན་པའི་བྱིན་གྱི་རླབས་ཀྱིས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Through the blessings of the verity of Brahmā, send down rainfall here in the continent of Jambudvīpa, svāhā.

source: བརྒྱ་བྱིན་གྱི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: By the verity of Indra, send down rainfall here in the continent of Jambudvīpa, svāhā.

source: རྒྱལ་པོ་ཆེན་པོ་བཞིའི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: By the verity of the Four Great Kings, send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུ་ཆེན་པོ་དག་བརྒྱད་པོའི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāgas, by the verity of the eight ones, send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུ་ཆེན་པོ་དག་རྒྱུན་དུ་ཞུགས་པའི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāgas, by the verity of the stream enterers, send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུ་ཆེན་པོ་དག་ལན་ཅིག་ཕྱིར་འོང་བའི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāgas, by the verity of the once-returners, send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུ་ཆེན་པོ་དག་ཕྱིར་མི་འོང་བའི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāgas, by the verity of the non-returners, send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུ་ཆེན་པོ་དག་དགྲ་བཅོམ་པའི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāgas, by the verity of the worthy ones, send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུ་ཆེན་པོ་དག་རང་སངས་རྒྱས་ཀྱི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāgas, by the verity of the pratyekabuddhas, send down rainfall here in the continent of Jambudvīpa, svāhā.
